Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_dppic.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; nrf5340_network_dppic.
; ======================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     nrf5340_network_dppic equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// DPPIC address definitions
// -------------------------

typedef struct {
    volatile    uint32_t    TASKS_CHG0_EN;
    volatile    uint32_t    TASKS_CHG0_DIS;
    volatile    uint32_t    TASKS_CHG1_EN;
    volatile    uint32_t    TASKS_CHG1_DIS;
    volatile    uint32_t    TASKS_CHG2_EN;
    volatile    uint32_t    TASKS_CHG2_DIS;
    volatile    uint32_t    TASKS_CHG3_EN;
    volatile    uint32_t    TASKS_CHG3_DIS;
    volatile    uint32_t    TASKS_CHG4_EN;
    volatile    uint32_t    TASKS_CHG4_DIS;
    volatile    uint32_t    TASKS_CHG5_EN;
    volatile    uint32_t    TASKS_CHG5_DIS;
    volatile    uint32_t    RESERVED0[20];
    volatile    uint32_t    SUBSCRIBE_CHG0_EN;
    volatile    uint32_t    SUBSCRIBE_CHG0_DIS;
    volatile    uint32_t    SUBSCRIBE_CHG1_EN;
    volatile    uint32_t    SUBSCRIBE_CHG1_DIS;
    volatile    uint32_t    SUBSCRIBE_CHG2_EN;
    volatile    uint32_t    SUBSCRIBE_CHG2_DIS;
    volatile    uint32_t    SUBSCRIBE_CHG3_EN;
    volatile    uint32_t    SUBSCRIBE_CHG3_DIS;
    volatile    uint32_t    SUBSCRIBE_CHG4_EN;
    volatile    uint32_t    SUBSCRIBE_CHG4_DIS;
    volatile    uint32_t    SUBSCRIBE_CHG5_EN;
    volatile    uint32_t    SUBSCRIBE_CHG5_DIS;
    volatile    uint32_t    RESERVED1[276];
    volatile    uint32_t    CHEN;
    volatile    uint32_t    CHENSET;
    volatile    uint32_t    CHENCLR;
    volatile    uint32_t    RESERVED2[189];
    volatile    uint32_t    CHG[6];
} DPPIC_TypeDef;

#ifdef __cplusplus
#define DPPIC_NS    reinterpret_cast<DPPIC_TypeDef *>(0x4100F000u)

#else
#define DPPIC_NS    ((DPPIC_TypeDef *)0x4100F000u)
#endif

// EN Configuration

#define DPPIC_TASKS_CHG_EN_EN                   (0x1u<<0)
#define DPPIC_TASKS_CHG_EN_EN_TRIGGER           (0x1u<<0)

// DIS Configuration

#define DPPIC_TASKS_CHG_DIS_DIS                 (0x1u<<0)
#define DPPIC_TASKS_CHG_DIS_DIS_TRIGGER         (0x1u<<0)

// EN Configuration

#define DPPIC_SUBSCRIBE_CHG_EN_EN               (0x1u<<31)
#define DPPIC_SUBSCRIBE_CHG_EN_CHIDX            (0xFFu<<0)
#define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_0          (0x1u<<0)
#define DPPIC_SUBSCRIBE_CHG_EN_EN_DISABLED      (0x0u<<31)
#define DPPIC_SUBSCRIBE_CHG_EN_EN_ENABLED       (0x1u<<31)

// DIS Configuration

#define DPPIC_SUBSCRIBE_CHG_DIS_EN              (0x1u<<31)
#define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX           (0xFFu<<0)
#define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_0         (0x1u<<0)
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_DISABLED     (0x0u<<31)
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_ENABLED      (0x1u<<31)

// CHEN Configuration

#define DPPIC_CHEN_CH31                         (0x1u<<31)
#define DPPIC_CHEN_CH30                         (0x1u<<30)
#define DPPIC_CHEN_CH29                         (0x1u<<29)
#define DPPIC_CHEN_CH28                         (0x1u<<28)
#define DPPIC_CHEN_CH27                         (0x1u<<27)
#define DPPIC_CHEN_CH26                         (0x1u<<26)
#define DPPIC_CHEN_CH25                         (0x1u<<25)
#define DPPIC_CHEN_CH24                         (0x1u<<24)
#define DPPIC_CHEN_CH23                         (0x1u<<23)
#define DPPIC_CHEN_CH22                         (0x1u<<22)
#define DPPIC_CHEN_CH21                         (0x1u<<21)
#define DPPIC_CHEN_CH20                         (0x1u<<20)
#define DPPIC_CHEN_CH19                         (0x1u<<19)
#define DPPIC_CHEN_CH18                         (0x1u<<18)
#define DPPIC_CHEN_CH17                         (0x1u<<17)
#define DPPIC_CHEN_CH16                         (0x1u<<16)
#define DPPIC_CHEN_CH15                         (0x1u<<15)
#define DPPIC_CHEN_CH14                         (0x1u<<14)
#define DPPIC_CHEN_CH13                         (0x1u<<13)
#define DPPIC_CHEN_CH12                         (0x1u<<12)
#define DPPIC_CHEN_CH11                         (0x1u<<11)
#define DPPIC_CHEN_CH10                         (0x1u<<10)
#define DPPIC_CHEN_CH9                          (0x1u<<9)
#define DPPIC_CHEN_CH8                          (0x1u<<8)
#define DPPIC_CHEN_CH7                          (0x1u<<7)
#define DPPIC_CHEN_CH6                          (0x1u<<6)
#define DPPIC_CHEN_CH5                          (0x1u<<5)
#define DPPIC_CHEN_CH4                          (0x1u<<4)
#define DPPIC_CHEN_CH3                          (0x1u<<3)
#define DPPIC_CHEN_CH2                          (0x1u<<2)
#define DPPIC_CHEN_CH1                          (0x1u<<1)
#define DPPIC_CHEN_CH0                          (0x1u<<0)
#define DPPIC_CHEN_CH31_DISABLED                (0x0u<<31)
#define DPPIC_CHEN_CH31_ENABLED                 (0x1u<<31)
#define DPPIC_CHEN_CH30_DISABLED                (0x0u<<30)
#define DPPIC_CHEN_CH30_ENABLED                 (0x1u<<30)
#define DPPIC_CHEN_CH29_DISABLED                (0x0u<<29)
#define DPPIC_CHEN_CH29_ENABLED                 (0x1u<<29)
#define DPPIC_CHEN_CH28_DISABLED                (0x0u<<28)
#define DPPIC_CHEN_CH28_ENABLED                 (0x1u<<28)
#define DPPIC_CHEN_CH27_DISABLED                (0x0u<<27)
#define DPPIC_CHEN_CH27_ENABLED                 (0x1u<<27)
#define DPPIC_CHEN_CH26_DISABLED                (0x0u<<26)
#define DPPIC_CHEN_CH26_ENABLED                 (0x1u<<26)
#define DPPIC_CHEN_CH25_DISABLED                (0x0u<<25)
#define DPPIC_CHEN_CH25_ENABLED                 (0x1u<<25)
#define DPPIC_CHEN_CH24_DISABLED                (0x0u<<24)
#define DPPIC_CHEN_CH24_ENABLED                 (0x1u<<24)
#define DPPIC_CHEN_CH23_DISABLED                (0x0u<<23)
#define DPPIC_CHEN_CH23_ENABLED                 (0x1u<<23)
#define DPPIC_CHEN_CH22_DISABLED                (0x0u<<22)
#define DPPIC_CHEN_CH22_ENABLED                 (0x1u<<22)
#define DPPIC_CHEN_CH21_DISABLED                (0x0u<<21)
#define DPPIC_CHEN_CH21_ENABLED                 (0x1u<<21)
#define DPPIC_CHEN_CH20_DISABLED                (0x0u<<20)
#define DPPIC_CHEN_CH20_ENABLED                 (0x1u<<20)
#define DPPIC_CHEN_CH19_DISABLED                (0x0u<<19)
#define DPPIC_CHEN_CH19_ENABLED                 (0x1u<<19)
#define DPPIC_CHEN_CH18_DISABLED                (0x0u<<18)
#define DPPIC_CHEN_CH18_ENABLED                 (0x1u<<18)
#define DPPIC_CHEN_CH17_DISABLED                (0x0u<<17)
#define DPPIC_CHEN_CH17_ENABLED                 (0x1u<<17)
#define DPPIC_CHEN_CH16_DISABLED                (0x0u<<16)
#define DPPIC_CHEN_CH16_ENABLED                 (0x1u<<16)
#define DPPIC_CHEN_CH15_DISABLED                (0x0u<<15)
#define DPPIC_CHEN_CH15_ENABLED                 (0x1u<<15)
#define DPPIC_CHEN_CH14_DISABLED                (0x0u<<14)
#define DPPIC_CHEN_CH14_ENABLED                 (0x1u<<14)
#define DPPIC_CHEN_CH13_DISABLED                (0x0u<<13)
#define DPPIC_CHEN_CH13_ENABLED                 (0x1u<<13)
#define DPPIC_CHEN_CH12_DISABLED                (0x0u<<12)
#define DPPIC_CHEN_CH12_ENABLED                 (0x1u<<12)
#define DPPIC_CHEN_CH11_DISABLED                (0x0u<<11)
#define DPPIC_CHEN_CH11_ENABLED                 (0x1u<<11)
#define DPPIC_CHEN_CH10_DISABLED                (0x0u<<10)
#define DPPIC_CHEN_CH10_ENABLED                 (0x1u<<10)
#define DPPIC_CHEN_CH9_DISABLED                 (0x0u<<9)
#define DPPIC_CHEN_CH9_ENABLED                  (0x1u<<9)
#define DPPIC_CHEN_CH8_DISABLED                 (0x0u<<8)
#define DPPIC_CHEN_CH8_ENABLED                  (0x1u<<8)
#define DPPIC_CHEN_CH7_DISABLED                 (0x0u<<7)
#define DPPIC_CHEN_CH7_ENABLED                  (0x1u<<7)
#define DPPIC_CHEN_CH6_DISABLED                 (0x0u<<6)
#define DPPIC_CHEN_CH6_ENABLED                  (0x1u<<6)
#define DPPIC_CHEN_CH5_DISABLED                 (0x0u<<5)
#define DPPIC_CHEN_CH5_ENABLED                  (0x1u<<5)
#define DPPIC_CHEN_CH4_DISABLED                 (0x0u<<4)
#define DPPIC_CHEN_CH4_ENABLED                  (0x1u<<4)
#define DPPIC_CHEN_CH3_DISABLED                 (0x0u<<3)
#define DPPIC_CHEN_CH3_ENABLED                  (0x1u<<3)
#define DPPIC_CHEN_CH2_DISABLED                 (0x0u<<2)
#define DPPIC_CHEN_CH2_ENABLED                  (0x1u<<2)
#define DPPIC_CHEN_CH1_DISABLED                 (0x0u<<1)
#define DPPIC_CHEN_CH1_ENABLED                  (0x1u<<1)
#define DPPIC_CHEN_CH0_DISABLED                 (0x0u<<0)
#define DPPIC_CHEN_CH0_ENABLED                  (0x1u<<0)

// CHENSET Configuration

#define DPPIC_CHENSET_CH31                      (0x1u<<31)
#define DPPIC_CHENSET_CH30                      (0x1u<<30)
#define DPPIC_CHENSET_CH29                      (0x1u<<29)
#define DPPIC_CHENSET_CH28                      (0x1u<<28)
#define DPPIC_CHENSET_CH27                      (0x1u<<27)
#define DPPIC_CHENSET_CH26                      (0x1u<<26)
#define DPPIC_CHENSET_CH25                      (0x1u<<25)
#define DPPIC_CHENSET_CH24                      (0x1u<<24)
#define DPPIC_CHENSET_CH23                      (0x1u<<23)
#define DPPIC_CHENSET_CH22                      (0x1u<<22)
#define DPPIC_CHENSET_CH21                      (0x1u<<21)
#define DPPIC_CHENSET_CH20                      (0x1u<<20)
#define DPPIC_CHENSET_CH19                      (0x1u<<19)
#define DPPIC_CHENSET_CH18                      (0x1u<<18)
#define DPPIC_CHENSET_CH17                      (0x1u<<17)
#define DPPIC_CHENSET_CH16                      (0x1u<<16)
#define DPPIC_CHENSET_CH15                      (0x1u<<15)
#define DPPIC_CHENSET_CH14                      (0x1u<<14)
#define DPPIC_CHENSET_CH13                      (0x1u<<13)
#define DPPIC_CHENSET_CH12                      (0x1u<<12)
#define DPPIC_CHENSET_CH11                      (0x1u<<11)
#define DPPIC_CHENSET_CH10                      (0x1u<<10)
#define DPPIC_CHENSET_CH9                       (0x1u<<9)
#define DPPIC_CHENSET_CH8                       (0x1u<<8)
#define DPPIC_CHENSET_CH7                       (0x1u<<7)
#define DPPIC_CHENSET_CH6                       (0x1u<<6)
#define DPPIC_CHENSET_CH5                       (0x1u<<5)
#define DPPIC_CHENSET_CH4                       (0x1u<<4)
#define DPPIC_CHENSET_CH3                       (0x1u<<3)
#define DPPIC_CHENSET_CH2                       (0x1u<<2)
#define DPPIC_CHENSET_CH1                       (0x1u<<1)
#define DPPIC_CHENSET_CH0                       (0x1u<<0)
#define DPPIC_CHENSET_CH31_DISABLED             (0x0u<<31)
#define DPPIC_CHENSET_CH31_ENABLED              (0x1u<<31)
#define DPPIC_CHENSET_CH31_SET                  (0x1u<<31)
#define DPPIC_CHENSET_CH30_DISABLED             (0x0u<<30)
#define DPPIC_CHENSET_CH30_ENABLED              (0x1u<<30)
#define DPPIC_CHENSET_CH30_SET                  (0x1u<<30)
#define DPPIC_CHENSET_CH29_DISABLED             (0x0u<<29)
#define DPPIC_CHENSET_CH29_ENABLED              (0x1u<<29)
#define DPPIC_CHENSET_CH29_SET                  (0x1u<<29)
#define DPPIC_CHENSET_CH28_DISABLED             (0x0u<<28)
#define DPPIC_CHENSET_CH28_ENABLED              (0x1u<<28)
#define DPPIC_CHENSET_CH28_SET                  (0x1u<<28)
#define DPPIC_CHENSET_CH27_DISABLED             (0x0u<<27)
#define DPPIC_CHENSET_CH27_ENABLED              (0x1u<<27)
#define DPPIC_CHENSET_CH27_SET                  (0x1u<<27)
#define DPPIC_CHENSET_CH26_DISABLED             (0x0u<<26)
#define DPPIC_CHENSET_CH26_ENABLED              (0x1u<<26)
#define DPPIC_CHENSET_CH26_SET                  (0x1u<<26)
#define DPPIC_CHENSET_CH25_DISABLED             (0x0u<<25)
#define DPPIC_CHENSET_CH25_ENABLED              (0x1u<<25)
#define DPPIC_CHENSET_CH25_SET                  (0x1u<<25)
#define DPPIC_CHENSET_CH24_DISABLED             (0x0u<<24)
#define DPPIC_CHENSET_CH24_ENABLED              (0x1u<<24)
#define DPPIC_CHENSET_CH24_SET                  (0x1u<<24)
#define DPPIC_CHENSET_CH23_DISABLED             (0x0u<<23)
#define DPPIC_CHENSET_CH23_ENABLED              (0x1u<<23)
#define DPPIC_CHENSET_CH23_SET                  (0x1u<<23)
#define DPPIC_CHENSET_CH22_DISABLED             (0x0u<<22)
#define DPPIC_CHENSET_CH22_ENABLED              (0x1u<<22)
#define DPPIC_CHENSET_CH22_SET                  (0x1u<<22)
#define DPPIC_CHENSET_CH21_DISABLED             (0x0u<<21)
#define DPPIC_CHENSET_CH21_ENABLED              (0x1u<<21)
#define DPPIC_CHENSET_CH21_SET                  (0x1u<<21)
#define DPPIC_CHENSET_CH20_DISABLED             (0x0u<<20)
#define DPPIC_CHENSET_CH20_ENABLED              (0x1u<<20)
#define DPPIC_CHENSET_CH20_SET                  (0x1u<<20)
#define DPPIC_CHENSET_CH19_DISABLED             (0x0u<<19)
#define DPPIC_CHENSET_CH19_ENABLED              (0x1u<<19)
#define DPPIC_CHENSET_CH19_SET                  (0x1u<<19)
#define DPPIC_CHENSET_CH18_DISABLED             (0x0u<<18)
#define DPPIC_CHENSET_CH18_ENABLED              (0x1u<<18)
#define DPPIC_CHENSET_CH18_SET                  (0x1u<<18)
#define DPPIC_CHENSET_CH17_DISABLED             (0x0u<<17)
#define DPPIC_CHENSET_CH17_ENABLED              (0x1u<<17)
#define DPPIC_CHENSET_CH17_SET                  (0x1u<<17)
#define DPPIC_CHENSET_CH16_DISABLED             (0x0u<<16)
#define DPPIC_CHENSET_CH16_ENABLED              (0x1u<<16)
#define DPPIC_CHENSET_CH16_SET                  (0x1u<<16)
#define DPPIC_CHENSET_CH15_DISABLED             (0x0u<<15)
#define DPPIC_CHENSET_CH15_ENABLED              (0x1u<<15)
#define DPPIC_CHENSET_CH15_SET                  (0x1u<<15)
#define DPPIC_CHENSET_CH14_DISABLED             (0x0u<<14)
#define DPPIC_CHENSET_CH14_ENABLED              (0x1u<<14)
#define DPPIC_CHENSET_CH14_SET                  (0x1u<<14)
#define DPPIC_CHENSET_CH13_DISABLED             (0x0u<<13)
#define DPPIC_CHENSET_CH13_ENABLED              (0x1u<<13)
#define DPPIC_CHENSET_CH13_SET                  (0x1u<<13)
#define DPPIC_CHENSET_CH12_DISABLED             (0x0u<<12)
#define DPPIC_CHENSET_CH12_ENABLED              (0x1u<<12)
#define DPPIC_CHENSET_CH12_SET                  (0x1u<<12)
#define DPPIC_CHENSET_CH11_DISABLED             (0x0u<<11)
#define DPPIC_CHENSET_CH11_ENABLED              (0x1u<<11)
#define DPPIC_CHENSET_CH11_SET                  (0x1u<<11)
#define DPPIC_CHENSET_CH10_DISABLED             (0x0u<<10)
#define DPPIC_CHENSET_CH10_ENABLED              (0x1u<<10)
#define DPPIC_CHENSET_CH10_SET                  (0x1u<<10)
#define DPPIC_CHENSET_CH9_DISABLED              (0x0u<<9)
#define DPPIC_CHENSET_CH9_ENABLED               (0x1u<<9)
#define DPPIC_CHENSET_CH9_SET                   (0x1u<<9)
#define DPPIC_CHENSET_CH8_DISABLED              (0x0u<<8)
#define DPPIC_CHENSET_CH8_ENABLED               (0x1u<<8)
#define DPPIC_CHENSET_CH8_SET                   (0x1u<<8)
#define DPPIC_CHENSET_CH7_DISABLED              (0x0u<<7)
#define DPPIC_CHENSET_CH7_ENABLED               (0x1u<<7)
#define DPPIC_CHENSET_CH7_SET                   (0x1u<<7)
#define DPPIC_CHENSET_CH6_DISABLED              (0x0u<<6)
#define DPPIC_CHENSET_CH6_ENABLED               (0x1u<<6)
#define DPPIC_CHENSET_CH6_SET                   (0x1u<<6)
#define DPPIC_CHENSET_CH5_DISABLED              (0x0u<<5)
#define DPPIC_CHENSET_CH5_ENABLED               (0x1u<<5)
#define DPPIC_CHENSET_CH5_SET                   (0x1u<<5)
#define DPPIC_CHENSET_CH4_DISABLED              (0x0u<<4)
#define DPPIC_CHENSET_CH4_ENABLED               (0x1u<<4)
#define DPPIC_CHENSET_CH4_SET                   (0x1u<<4)
#define DPPIC_CHENSET_CH3_DISABLED              (0x0u<<3)
#define DPPIC_CHENSET_CH3_ENABLED               (0x1u<<3)
#define DPPIC_CHENSET_CH3_SET                   (0x1u<<3)
#define DPPIC_CHENSET_CH2_DISABLED              (0x0u<<2)
#define DPPIC_CHENSET_CH2_ENABLED               (0x1u<<2)
#define DPPIC_CHENSET_CH2_SET                   (0x1u<<2)
#define DPPIC_CHENSET_CH1_DISABLED              (0x0u<<1)
#define DPPIC_CHENSET_CH1_ENABLED               (0x1u<<1)
#define DPPIC_CHENSET_CH1_SET                   (0x1u<<1)
#define DPPIC_CHENSET_CH0_DISABLED              (0x0u<<0)
#define DPPIC_CHENSET_CH0_ENABLED               (0x1u<<0)
#define DPPIC_CHENSET_CH0_SET                   (0x1u<<0)

