Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_dppic.h
// CHENCLR Configuration

#define DPPIC_CHENCLR_CH31                      (0x1u<<31)
#define DPPIC_CHENCLR_CH30                      (0x1u<<30)
#define DPPIC_CHENCLR_CH29                      (0x1u<<29)
#define DPPIC_CHENCLR_CH28                      (0x1u<<28)
#define DPPIC_CHENCLR_CH27                      (0x1u<<27)
#define DPPIC_CHENCLR_CH26                      (0x1u<<26)
#define DPPIC_CHENCLR_CH25                      (0x1u<<25)
#define DPPIC_CHENCLR_CH24                      (0x1u<<24)
#define DPPIC_CHENCLR_CH23                      (0x1u<<23)
#define DPPIC_CHENCLR_CH22                      (0x1u<<22)
#define DPPIC_CHENCLR_CH21                      (0x1u<<21)
#define DPPIC_CHENCLR_CH20                      (0x1u<<20)
#define DPPIC_CHENCLR_CH19                      (0x1u<<19)
#define DPPIC_CHENCLR_CH18                      (0x1u<<18)
#define DPPIC_CHENCLR_CH17                      (0x1u<<17)
#define DPPIC_CHENCLR_CH16                      (0x1u<<16)
#define DPPIC_CHENCLR_CH15                      (0x1u<<15)
#define DPPIC_CHENCLR_CH14                      (0x1u<<14)
#define DPPIC_CHENCLR_CH13                      (0x1u<<13)
#define DPPIC_CHENCLR_CH12                      (0x1u<<12)
#define DPPIC_CHENCLR_CH11                      (0x1u<<11)
#define DPPIC_CHENCLR_CH10                      (0x1u<<10)
#define DPPIC_CHENCLR_CH9                       (0x1u<<9)
#define DPPIC_CHENCLR_CH8                       (0x1u<<8)
#define DPPIC_CHENCLR_CH7                       (0x1u<<7)
#define DPPIC_CHENCLR_CH6                       (0x1u<<6)
#define DPPIC_CHENCLR_CH5                       (0x1u<<5)
#define DPPIC_CHENCLR_CH4                       (0x1u<<4)
#define DPPIC_CHENCLR_CH3                       (0x1u<<3)
#define DPPIC_CHENCLR_CH2                       (0x1u<<2)
#define DPPIC_CHENCLR_CH1                       (0x1u<<1)
#define DPPIC_CHENCLR_CH0                       (0x1u<<0)
#define DPPIC_CHENCLR_CH31_DISABLED             (0x0u<<31)
#define DPPIC_CHENCLR_CH31_ENABLED              (0x1u<<31)
#define DPPIC_CHENCLR_CH31_CLEAR                (0x1u<<31)
#define DPPIC_CHENCLR_CH30_DISABLED             (0x0u<<30)
#define DPPIC_CHENCLR_CH30_ENABLED              (0x1u<<30)
#define DPPIC_CHENCLR_CH30_CLEAR                (0x1u<<30)
#define DPPIC_CHENCLR_CH29_DISABLED             (0x0u<<29)
#define DPPIC_CHENCLR_CH29_ENABLED              (0x1u<<29)
#define DPPIC_CHENCLR_CH29_CLEAR                (0x1u<<29)
#define DPPIC_CHENCLR_CH28_DISABLED             (0x0u<<28)
#define DPPIC_CHENCLR_CH28_ENABLED              (0x1u<<28)
#define DPPIC_CHENCLR_CH28_CLEAR                (0x1u<<28)
#define DPPIC_CHENCLR_CH27_DISABLED             (0x0u<<27)
#define DPPIC_CHENCLR_CH27_ENABLED              (0x1u<<27)
#define DPPIC_CHENCLR_CH27_CLEAR                (0x1u<<27)
#define DPPIC_CHENCLR_CH26_DISABLED             (0x0u<<26)
#define DPPIC_CHENCLR_CH26_ENABLED              (0x1u<<26)
#define DPPIC_CHENCLR_CH26_CLEAR                (0x1u<<26)
#define DPPIC_CHENCLR_CH25_DISABLED             (0x0u<<25)
#define DPPIC_CHENCLR_CH25_ENABLED              (0x1u<<25)
#define DPPIC_CHENCLR_CH25_CLEAR                (0x1u<<25)
#define DPPIC_CHENCLR_CH24_DISABLED             (0x0u<<24)
#define DPPIC_CHENCLR_CH24_ENABLED              (0x1u<<24)
#define DPPIC_CHENCLR_CH24_CLEAR                (0x1u<<24)
#define DPPIC_CHENCLR_CH23_DISABLED             (0x0u<<23)
#define DPPIC_CHENCLR_CH23_ENABLED              (0x1u<<23)
#define DPPIC_CHENCLR_CH23_CLEAR                (0x1u<<23)
#define DPPIC_CHENCLR_CH22_DISABLED             (0x0u<<22)
#define DPPIC_CHENCLR_CH22_ENABLED              (0x1u<<22)
#define DPPIC_CHENCLR_CH22_CLEAR                (0x1u<<22)
#define DPPIC_CHENCLR_CH21_DISABLED             (0x0u<<21)
#define DPPIC_CHENCLR_CH21_ENABLED              (0x1u<<21)
#define DPPIC_CHENCLR_CH21_CLEAR                (0x1u<<21)
#define DPPIC_CHENCLR_CH20_DISABLED             (0x0u<<20)
#define DPPIC_CHENCLR_CH20_ENABLED              (0x1u<<20)
#define DPPIC_CHENCLR_CH20_CLEAR                (0x1u<<20)
#define DPPIC_CHENCLR_CH19_DISABLED             (0x0u<<19)
#define DPPIC_CHENCLR_CH19_ENABLED              (0x1u<<19)
#define DPPIC_CHENCLR_CH19_CLEAR                (0x1u<<19)
#define DPPIC_CHENCLR_CH18_DISABLED             (0x0u<<18)
#define DPPIC_CHENCLR_CH18_ENABLED              (0x1u<<18)
#define DPPIC_CHENCLR_CH18_CLEAR                (0x1u<<18)
#define DPPIC_CHENCLR_CH17_DISABLED             (0x0u<<17)
#define DPPIC_CHENCLR_CH17_ENABLED              (0x1u<<17)
#define DPPIC_CHENCLR_CH17_CLEAR                (0x1u<<17)
#define DPPIC_CHENCLR_CH16_DISABLED             (0x0u<<16)
#define DPPIC_CHENCLR_CH16_ENABLED              (0x1u<<16)
#define DPPIC_CHENCLR_CH16_CLEAR                (0x1u<<16)
#define DPPIC_CHENCLR_CH15_DISABLED             (0x0u<<15)
#define DPPIC_CHENCLR_CH15_ENABLED              (0x1u<<15)
#define DPPIC_CHENCLR_CH15_CLEAR                (0x1u<<15)
#define DPPIC_CHENCLR_CH14_DISABLED             (0x0u<<14)
#define DPPIC_CHENCLR_CH14_ENABLED              (0x1u<<14)
#define DPPIC_CHENCLR_CH14_CLEAR                (0x1u<<14)
#define DPPIC_CHENCLR_CH13_DISABLED             (0x0u<<13)
#define DPPIC_CHENCLR_CH13_ENABLED              (0x1u<<13)
#define DPPIC_CHENCLR_CH13_CLEAR                (0x1u<<13)
#define DPPIC_CHENCLR_CH12_DISABLED             (0x0u<<12)
#define DPPIC_CHENCLR_CH12_ENABLED              (0x1u<<12)
#define DPPIC_CHENCLR_CH12_CLEAR                (0x1u<<12)
#define DPPIC_CHENCLR_CH11_DISABLED             (0x0u<<11)
#define DPPIC_CHENCLR_CH11_ENABLED              (0x1u<<11)
#define DPPIC_CHENCLR_CH11_CLEAR                (0x1u<<11)
#define DPPIC_CHENCLR_CH10_DISABLED             (0x0u<<10)
#define DPPIC_CHENCLR_CH10_ENABLED              (0x1u<<10)
#define DPPIC_CHENCLR_CH10_CLEAR                (0x1u<<10)
#define DPPIC_CHENCLR_CH9_DISABLED              (0x0u<<9)
#define DPPIC_CHENCLR_CH9_ENABLED               (0x1u<<9)
#define DPPIC_CHENCLR_CH9_CLEAR                 (0x1u<<9)
#define DPPIC_CHENCLR_CH8_DISABLED              (0x0u<<8)
#define DPPIC_CHENCLR_CH8_ENABLED               (0x1u<<8)
#define DPPIC_CHENCLR_CH8_CLEAR                 (0x1u<<8)
#define DPPIC_CHENCLR_CH7_DISABLED              (0x0u<<7)
#define DPPIC_CHENCLR_CH7_ENABLED               (0x1u<<7)
#define DPPIC_CHENCLR_CH7_CLEAR                 (0x1u<<7)
#define DPPIC_CHENCLR_CH6_DISABLED              (0x0u<<6)
#define DPPIC_CHENCLR_CH6_ENABLED               (0x1u<<6)
#define DPPIC_CHENCLR_CH6_CLEAR                 (0x1u<<6)
#define DPPIC_CHENCLR_CH5_DISABLED              (0x0u<<5)
#define DPPIC_CHENCLR_CH5_ENABLED               (0x1u<<5)
#define DPPIC_CHENCLR_CH5_CLEAR                 (0x1u<<5)
#define DPPIC_CHENCLR_CH4_DISABLED              (0x0u<<4)
#define DPPIC_CHENCLR_CH4_ENABLED               (0x1u<<4)
#define DPPIC_CHENCLR_CH4_CLEAR                 (0x1u<<4)
#define DPPIC_CHENCLR_CH3_DISABLED              (0x0u<<3)
#define DPPIC_CHENCLR_CH3_ENABLED               (0x1u<<3)
#define DPPIC_CHENCLR_CH3_CLEAR                 (0x1u<<3)
#define DPPIC_CHENCLR_CH2_DISABLED              (0x0u<<2)
#define DPPIC_CHENCLR_CH2_ENABLED               (0x1u<<2)
#define DPPIC_CHENCLR_CH2_CLEAR                 (0x1u<<2)
#define DPPIC_CHENCLR_CH1_DISABLED              (0x0u<<1)
#define DPPIC_CHENCLR_CH1_ENABLED               (0x1u<<1)
#define DPPIC_CHENCLR_CH1_CLEAR                 (0x1u<<1)
#define DPPIC_CHENCLR_CH0_DISABLED              (0x0u<<0)
#define DPPIC_CHENCLR_CH0_ENABLED               (0x1u<<0)
#define DPPIC_CHENCLR_CH0_CLEAR                 (0x1u<<0)

// CHG Configuration

