Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_dppic.h
#define DPPIC_CHG_CH31                          (0x1u<<31)
#define DPPIC_CHG_CH30                          (0x1u<<30)
#define DPPIC_CHG_CH29                          (0x1u<<29)
#define DPPIC_CHG_CH28                          (0x1u<<28)
#define DPPIC_CHG_CH27                          (0x1u<<27)
#define DPPIC_CHG_CH26                          (0x1u<<26)
#define DPPIC_CHG_CH25                          (0x1u<<25)
#define DPPIC_CHG_CH24                          (0x1u<<24)
#define DPPIC_CHG_CH23                          (0x1u<<23)
#define DPPIC_CHG_CH22                          (0x1u<<22)
#define DPPIC_CHG_CH21                          (0x1u<<21)
#define DPPIC_CHG_CH20                          (0x1u<<20)
#define DPPIC_CHG_CH19                          (0x1u<<19)
#define DPPIC_CHG_CH18                          (0x1u<<18)
#define DPPIC_CHG_CH17                          (0x1u<<17)
#define DPPIC_CHG_CH16                          (0x1u<<16)
#define DPPIC_CHG_CH15                          (0x1u<<15)
#define DPPIC_CHG_CH14                          (0x1u<<14)
#define DPPIC_CHG_CH13                          (0x1u<<13)
#define DPPIC_CHG_CH12                          (0x1u<<12)
#define DPPIC_CHG_CH11                          (0x1u<<11)
#define DPPIC_CHG_CH10                          (0x1u<<10)
#define DPPIC_CHG_CH9                           (0x1u<<9)
#define DPPIC_CHG_CH8                           (0x1u<<8)
#define DPPIC_CHG_CH7                           (0x1u<<7)
#define DPPIC_CHG_CH6                           (0x1u<<6)
#define DPPIC_CHG_CH5                           (0x1u<<5)
#define DPPIC_CHG_CH4                           (0x1u<<4)
#define DPPIC_CHG_CH3                           (0x1u<<3)
#define DPPIC_CHG_CH2                           (0x1u<<2)
#define DPPIC_CHG_CH1                           (0x1u<<1)
#define DPPIC_CHG_CH0                           (0x1u<<0)
#define DPPIC_CHG_CH31_EXCLUDED                 (0x0u<<31)
#define DPPIC_CHG_CH31_INCLUDED                 (0x1u<<31)
#define DPPIC_CHG_CH30_EXCLUDED                 (0x0u<<30)
#define DPPIC_CHG_CH30_INCLUDED                 (0x1u<<30)
#define DPPIC_CHG_CH29_EXCLUDED                 (0x0u<<29)
#define DPPIC_CHG_CH29_INCLUDED                 (0x1u<<29)
#define DPPIC_CHG_CH28_EXCLUDED                 (0x0u<<28)
#define DPPIC_CHG_CH28_INCLUDED                 (0x1u<<28)
#define DPPIC_CHG_CH27_EXCLUDED                 (0x0u<<27)
#define DPPIC_CHG_CH27_INCLUDED                 (0x1u<<27)
#define DPPIC_CHG_CH26_EXCLUDED                 (0x0u<<26)
#define DPPIC_CHG_CH26_INCLUDED                 (0x1u<<26)
#define DPPIC_CHG_CH25_EXCLUDED                 (0x0u<<25)
#define DPPIC_CHG_CH25_INCLUDED                 (0x1u<<25)
#define DPPIC_CHG_CH24_EXCLUDED                 (0x0u<<24)
#define DPPIC_CHG_CH24_INCLUDED                 (0x1u<<24)
#define DPPIC_CHG_CH23_EXCLUDED                 (0x0u<<23)
#define DPPIC_CHG_CH23_INCLUDED                 (0x1u<<23)
#define DPPIC_CHG_CH22_EXCLUDED                 (0x0u<<22)
#define DPPIC_CHG_CH22_INCLUDED                 (0x1u<<22)
#define DPPIC_CHG_CH21_EXCLUDED                 (0x0u<<21)
#define DPPIC_CHG_CH21_INCLUDED                 (0x1u<<21)
#define DPPIC_CHG_CH20_EXCLUDED                 (0x0u<<20)
#define DPPIC_CHG_CH20_INCLUDED                 (0x1u<<20)
#define DPPIC_CHG_CH19_EXCLUDED                 (0x0u<<19)
#define DPPIC_CHG_CH19_INCLUDED                 (0x1u<<19)
#define DPPIC_CHG_CH18_EXCLUDED                 (0x0u<<18)
#define DPPIC_CHG_CH18_INCLUDED                 (0x1u<<18)
#define DPPIC_CHG_CH17_EXCLUDED                 (0x0u<<17)
#define DPPIC_CHG_CH17_INCLUDED                 (0x1u<<17)
#define DPPIC_CHG_CH16_EXCLUDED                 (0x0u<<16)
#define DPPIC_CHG_CH16_INCLUDED                 (0x1u<<16)
#define DPPIC_CHG_CH15_EXCLUDED                 (0x0u<<15)
#define DPPIC_CHG_CH15_INCLUDED                 (0x1u<<15)
#define DPPIC_CHG_CH14_EXCLUDED                 (0x0u<<14)
#define DPPIC_CHG_CH14_INCLUDED                 (0x1u<<14)
#define DPPIC_CHG_CH13_EXCLUDED                 (0x0u<<13)
#define DPPIC_CHG_CH13_INCLUDED                 (0x1u<<13)
#define DPPIC_CHG_CH12_EXCLUDED                 (0x0u<<12)
#define DPPIC_CHG_CH12_INCLUDED                 (0x1u<<12)
#define DPPIC_CHG_CH11_EXCLUDED                 (0x0u<<11)
#define DPPIC_CHG_CH11_INCLUDED                 (0x1u<<11)
#define DPPIC_CHG_CH10_EXCLUDED                 (0x0u<<10)
#define DPPIC_CHG_CH10_INCLUDED                 (0x1u<<10)
#define DPPIC_CHG_CH9_EXCLUDED                  (0x0u<<9)
#define DPPIC_CHG_CH9_INCLUDED                  (0x1u<<9)
#define DPPIC_CHG_CH8_EXCLUDED                  (0x0u<<8)
#define DPPIC_CHG_CH8_INCLUDED                  (0x1u<<8)
#define DPPIC_CHG_CH7_EXCLUDED                  (0x0u<<7)
#define DPPIC_CHG_CH7_INCLUDED                  (0x1u<<7)
#define DPPIC_CHG_CH6_EXCLUDED                  (0x0u<<6)
#define DPPIC_CHG_CH6_INCLUDED                  (0x1u<<6)
#define DPPIC_CHG_CH5_EXCLUDED                  (0x0u<<5)
#define DPPIC_CHG_CH5_INCLUDED                  (0x1u<<5)
#define DPPIC_CHG_CH4_EXCLUDED                  (0x0u<<4)
#define DPPIC_CHG_CH4_INCLUDED                  (0x1u<<4)
#define DPPIC_CHG_CH3_EXCLUDED                  (0x0u<<3)
#define DPPIC_CHG_CH3_INCLUDED                  (0x1u<<3)
#define DPPIC_CHG_CH2_EXCLUDED                  (0x0u<<2)
#define DPPIC_CHG_CH2_INCLUDED                  (0x1u<<2)
#define DPPIC_CHG_CH1_EXCLUDED                  (0x0u<<1)
#define DPPIC_CHG_CH1_INCLUDED                  (0x1u<<1)
#define DPPIC_CHG_CH0_EXCLUDED                  (0x0u<<0)
#define DPPIC_CHG_CH0_INCLUDED                  (0x1u<<0)
